`create_privilieged_df` example
-----

### Load packages

In [1]:
from transparentai.datasets import load_adult
import transparentai.fairness as fairness

### Load data

In [2]:
data = load_adult()

In [3]:
data.sample(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
39502,21,Private,185948,Some-college,10,Never-married,Sales,Own-child,White,Male,0,0,35,United-States,<=50K
23008,31,Private,345122,Prof-school,15,Divorced,Prof-specialty,Not-in-family,White,Male,14084,0,50,United-States,>50K
42815,59,Private,139344,Some-college,10,Married-civ-spouse,Adm-clerical,Wife,White,Female,0,0,40,United-States,>50K

### Create `privileged_group` dictionnary

In [5]:
privileged_group = {
    'gender':['Male'],                # privileged group is man for gender attribute
    'age': lambda x: x > 30 & x < 55  # privileged group aged between 30 and 55 years old
}

### Use `create_privilieged_df` function

In [6]:
privileged_df = fairness.create_privilieged_df(data, privileged_group)

In [7]:
privileged_df

       gender  age
0           1    1
1           1    1
2           1    0
3           1    1
4           0    0
...       ...  ...
48837       0    1
48838       1    1
48839       0    1
48840       1    0
48841       0    1

[48842 rows x 2 columns]

In [8]:
privileged_df['gender'].value_counts()

1    32650
0    16192
Name: gender, dtype: int64

In [9]:
privileged_df['age'].value_counts()

1    40772
0     8070
Name: age, dtype: int64

Great ! So we can see that in the adult dataset, there are more men than women and a lot of adult.